app/views/questions/show.html.erb

SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  [["question_id", 4]]
---
  <strong>Answers:</strong>
  <% @question.answers.each do |f| %>