app/views/answers/_form.html.erb

SELECT "quantifiers".* FROM "quantifiers"   ORDER BY "quantifiers"."text" ASC
---
      <%= f.label :quantifier %>
      <%= f.collection_select :quantifier, Quantifier.order(:text),:text, :text, include_blank: false %>