app/controllers/answers_controller.rb

  def index
    if params.has_key?(:user_id)
      @id = params[:user_id]
      @answers = Answer.where(:user_id => @id)
    elsif params.has_key?(:question_id)
      @answers = Answer.find_by_question_id(params[:question_id])
    elsif params.has_key?(:quantifier)
      @answers = Answer.find_by_quantifier(params[:quantifier])
    else
      @answers = Answer.all
---
SELECT "answers".* FROM "answers"  WHERE "answers"."user_id" = $1  [["user_id", 1]]
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = 17
SELECT "answers".* FROM "answers"  WHERE "answers"."quantifier" = 'Hungry'
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 16]]
SELECT "answers".* FROM "answers"

  def create
    @answer = Answer.new(answer_params)
    @answer.save
---
INSERT INTO "answers" ("answer_text", "created_at", "quantifier", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["answer_text", "poop as usual💩"], ["created_at", "2014-11-19 05:33:42.976095"], ["quantifier", ""], ["question_id", 16], ["updated_at", "2014-11-19 05:33:42.976095"], ["user_id", 6]]

  def update
    @answer.update(answer_params)
---
UPDATE "answers" SET "answer_image_content_type" = $1, "answer_image_file_name" = $2, "answer_image_file_size" = $3, "answer_image_updated_at" = $4, "quantifier" = $5, "question_id" = $6, "updated_at" = $7 WHERE "answers"."id" = 15

  def destroy
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 17]]

  def set_answer
    @answer = Answer.find(params[:id])
---
SELECT  "answers".* FROM "answers"  WHERE "answers"."id" = $1 LIMIT 1  [["id", 21]]