app/controllers/quantifiers_controller.rb

  def index
    @quantifiers = Quantifier.all
---
SELECT "quantifiers".* FROM "quantifiers"

  def create
    @quantifier = Quantifier.new(quantifier_params)

    respond_to do |format|
      if @quantifier.save
---
INSERT INTO "quantifiers" ("created_at", "game_id", "text", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-13 02:59:21.712555"], ["game_id", 1], ["text", "Disgusted"], ["updated_at", "2014-12-13 02:59:21.712555"]]

  def destroy
    @quantifier.destroy
---
DELETE FROM "quantifiers" WHERE "quantifiers"."id" = $1  [["id", 5]]

    def set_quantifier
      @quantifier = Quantifier.find(params[:id])
---
SELECT  "quantifiers".* FROM "quantifiers"  WHERE "quantifiers"."id" = $1 LIMIT 1  [["id", 5]]