app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
SELECT  "questions".* FROM "questions"  WHERE "questions"."question_type" = 'nil' LIMIT 1
---
  def index
    @questions = Question.all
    if params.has_key?(:qtype)
      @questions = Question.where(:question_type => params[:qtype])

INSERT INTO "questions" ("created_at", "description", "location", "question_text", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-31 00:13:19.311143"], ["description", "poop is tasty"], ["location", "in the bathroom"], ["question_text", "Testing 1"], ["updated_at", "2014-10-31 00:13:19.311143"]]
---
  def create
    @question = Question.new(question_params)
    @question.save

UPDATE "questions" SET "picture" = $1, "updated_at" = $2 WHERE "questions"."id" = 2  [["picture", "tjw7xsqjnwuljf4kl2ax.png"], ["updated_at", "2014-10-31 01:01:35.930100"]]
---
  def update
    @question.update(question_params)

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]
---
  def destroy
    @question.destroy