app/controllers/question_types_controller.rb

  def index
    @question_types = QuestionType.all
---
SELECT "question_types".* FROM "question_types"