app/controllers/sessions_controller.rb

SELECT  "api_keys".* FROM "api_keys"  WHERE "api_keys"."user_id" IS NULL LIMIT 1
---
  def destroy
    id = session[:user_id]
    if params.has_key?(:api_key)
      ApiKey.find_by_key(params[:api_key]).delete
      return true
    end
    session[:user_id] = nil
    ApiKey.find_by_user_id(id).delete