app/controllers/sessions_controller.rb

DELETE FROM "api_keys" WHERE "api_keys"."id" = $1  [["id", 18]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 13]]
---
  def create
#try to authenticate the user - if they authenticate successfully, an instance of the User model is returned
    @user = User.authenticate(params[:email], params[:password])
#if an instance is returned and @user is not nil...
    if @user
      @user.destroy_api_key

DELETE FROM "api_keys" WHERE "api_keys"."id" = 2
SELECT  "api_keys".* FROM "api_keys"  WHERE "api_keys"."key" IS NULL LIMIT 1
---
  def destroy
    id = session[:user_id]
    if params.has_key?(:api_key)
      ApiKey.find_by_key(params[:api_key]).delete