app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "game_id", "isAdmin", "name", "roles_mask", "salt", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "encrypted_password" = $1, "salt" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["encrypted_password", "$2a$10$mAEoQ6.LTCA163VkhL4W4eeNpi6Mm9Gg7extN0qQrAUOETDel.rKq"], ["salt", "$2a$10$mAEoQ6.LTCA163VkhL4W4e"], ["updated_at", "2014-11-09 05:34:40.688477"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)